meeting/agenda/2024/07-02.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>QT4 CG Meeting 084 Agenda 2024-07-02</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="/meeting/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="../../../css/style.css"/>
<link rel="shortcut icon" href="/img/QT4-64.png" />
<link rel="apple-touch-icon" sizes="64x64" href="/img/QT4-64.png" type="image/png" />
<link rel="apple-touch-icon" sizes="76x76" href="/img/QT4-76.png" type="image/png" />
<link rel="apple-touch-icon" sizes="120x120" href="/img/QT4-120.png" type="image/png" />
<link rel="apple-touch-icon" sizes="152x152" href="/img/QT4-152.png" type="image/png" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">QT4 CG Meeting 084 Agenda 2024-07-02</h1>
<p>
<a href="../">Agenda index</a> / <a href="https://qt4cg.org">QT4CG.org</a> / <a href="https://qt4cg.org/dashboard">Dashboard</a> / <a href="https://github.com/qt4cg/qtspecs/issues">GH Issues</a> / <a href="https://github.com/qt4cg/qtspecs/pulls">GH Pull Requests</a>
</p>

<div id="outline-container-agenda" class="outline-2">
<h2 id="agenda">Agenda</h2>
<div class="outline-text-2" id="text-agenda">
<p>
This meeting will be hosted on Zoom at 16:00BST (15:00GMT, 17:00CEST, 11:00EDT) 
</p>

<p>
See the <a href="https://qt4cg.org/meeting/logistics.html">meeting logistics</a> page for details.
</p>
</div>
</div>

<div id="outline-container-administrivia" class="outline-2">
<h2 id="administrivia"><span class="section-number-2">1.</span> Administrivia</h2>
<div class="outline-text-2" id="text-administrivia">
</div>

<div id="outline-container-roll-call" class="outline-3">
<h3 id="roll-call"><span class="section-number-3">1.1.</span> Roll call</h3>
<div class="outline-text-3" id="text-roll-call">
</div>
</div>

<div id="outline-container-accept-agenda" class="outline-3">
<h3 id="accept-agenda"><span class="section-number-3">1.2.</span> Approve the agenda</h3>
<div class="outline-text-3" id="text-accept-agenda">
</div>
</div>

<div id="outline-container-approve-minutes" class="outline-3">
<h3 id="approve-minutes"><span class="section-number-3">1.3.</span> Approve minutes of previous meeting</h3>
<div class="outline-text-3" id="text-approve-minutes">
<p>
Minutes of <a href="../../minutes/2024/06-25.html">the previous meeting</a>.
</p>
</div>
</div>

<div id="outline-container-next-meeting" class="outline-3">
<h3 id="next-meeting"><span class="section-number-3">1.4.</span> Next meeting</h3>
<div class="outline-text-3" id="text-next-meeting">
<p>
This meeting is planned for 2 July. The following meeting is scheduled for
9 July.
</p>

<p>
Are we going to take a summer holiday this year?
</p>
</div>
</div>

<div id="outline-container-open-actions" class="outline-3">
<h3 id="open-actions"><span class="section-number-3">1.5.</span> Review of open action items <code>[2/18]</code></h3>
<div class="outline-text-3" id="text-open-actions">
<p>
(Items marked [X] are believed to have been closed via email before
this agenda was posted.)
</p>

<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> QT4CG-079-01: WP to seek expert advice on hashing functions.</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-080-05: NW to add absolute property to the parse-uri output</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-080-07: NW to update the build instructions in the README</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-082-02: DN to work with MK to come to agreement on the fn:ranks proposal</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-083-01 MK to revise fn:collation-available to address multiple usages</li>
</ul>
</div>
</div>

<div id="outline-container-open-pull-requests" class="outline-3">
<h3 id="open-pull-requests"><span class="section-number-3">1.6.</span> Review of open pull requests and issues</h3>
<div class="outline-text-3" id="text-open-pull-requests">
</div>

<div id="outline-container-blocked" class="outline-4">
<h4 id="blocked"><span class="section-number-4">1.6.1.</span> Blocked</h4>
<div class="outline-text-4" id="text-blocked">
<p>
The following PRs are open but have merge conflicts or comments which
suggest they aren’t ready for action.
</p>

<ul class="org-ul">
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1231">#1231</a>: 1193 Parsing Functions: Empty input</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1227">#1227</a>: 150 PR resubmission for fn ranks</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1062">#1062</a>: 150bis - revised proposal for fn:ranks</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-529">#529</a>: 528 fn:elements-to-maps</li>
</ul>
</div>
</div>

<div id="outline-container-merge-without-discussion" class="outline-4">
<h4 id="merge-without-discussion"><span class="section-number-4">1.6.2.</span> Merge without discussion</h4>
<div class="outline-text-4" id="text-merge-without-discussion">
<p>
The following PRs are editorial, small, or otherwise appeared to be
uncontroversial when the agenda was prepared. The chairs propose that
these can be merged without discussion. If you think discussion is
necessary, please say so.
</p>

<ul class="org-ul">
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1293">#1293</a>: 1289 Delete XQuery Appendix J</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1265">#1265</a>: 1161 Further revision of document-uri constraints</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1254">#1254</a>: 729 Add rules for use of xsi:schemaLocation during validation</li>
</ul>
</div>
</div>

<div id="outline-container-substantive" class="outline-4">
<h4 id="substantive"><span class="section-number-4">1.6.3.</span> Substantive PRs</h4>
<div class="outline-text-4" id="text-substantive">
<p>
The following substantive PRs were open when this agenda was prepared.
</p>

<ul class="org-ul">
<li>PR <a href="https://qt4cg.org/dashboard/#pr-832">#832</a>: 77 Lookup returning path selection</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1306">#1306</a>: 46 Add @as attribute to xsl:sequence</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1296">#1296</a>: 982 Rewrite of scan-left and scan-right</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1283">#1283</a>: 77b: Update expressions</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1266">#1266</a>: 1158 Add array mapping operator</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1263">#1263</a>: 1224 Add xsl:accumulator-rule/@priority attribute</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1262">#1262</a>: 1160 Add collation-available() function</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1244">#1244</a>: 566-partial Rewrite parse-uri</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1228">#1228</a>: – Adding the BLAKE3 hashing algorithm to fn:hash</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1209">#1209</a>: 1183 Add transient mode and the transient{} expression</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1185">#1185</a>: 1179 array:values, map:values → array:get, map:get</li>
</ul>
</div>
</div>

<div id="outline-container-required-40" class="outline-4">
<h4 id="required-40"><span class="section-number-4">1.6.4.</span> Required for V4.0</h4>
<div class="outline-text-4" id="text-required-40">
<p>
The following issues are labeled “required for V4.0”.
</p>

<ul class="org-ul">
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1252">#1252</a>: Add a new function `fn:html-doc`</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1240">#1240</a>: $sequence-of-maps ? info()</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1238">#1238</a>: XSLT on-no-match="shallow-copy-all" - revised rules</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1235">#1235</a>: Function Identity: Treating function items with identical bodies</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1202">#1202</a>: XQFO: Rendering of new/updated functions</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1169">#1169</a>: Maps &amp; Arrays: Consistency &amp; Terminology</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1161">#1161</a>: More changes to drop the requirement for document-uri() uniqueness</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1158">#1158</a>: Simple mapping operator for arrays</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1127">#1127</a>: Binary resources</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1045">#1045</a>: Functions to manage namespace usage</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1021">#1021</a>: Extend `fn:doc`, `fn:collection` and `fn:uri-collection` with options maps</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1014">#1014</a>: Predicates, sequences of numbers: Feedback</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1011">#1011</a>: fn:transform() improvements</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/986">#986</a>: Numeric Comparisons</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/967">#967</a>: XPath Appendix I: Comparisons</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/868">#868</a>: fn:intersperse → fn:join, array:join($arrays, $separator)</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/826">#826</a>: Arrays: Representation of single members of an array</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/767">#767</a>: parse-html(): case of SVG element names</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/755">#755</a>: Expression for binding the Context Value</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/748">#748</a>: Parse functions: consistency</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/729">#729</a>: xsi:schemaLocation</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/689">#689</a>: fn:stack-trace: keep, drop, replace with $err:stack-trace ?</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/675">#675</a>: XSLT streaming rules for new constructs</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/501">#501</a>: Error handling: Rethrow errors; finally block</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/490">#490</a>: Control over schema validation in parse-xml(), doc(), etc.</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/407">#407</a>: XSLT-specific context properties used in function items</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/272">#272</a>: Setting parameter values in xsl:use-package</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/69">#69</a>: fn:document, fn:function-available: default arguments</li>
</ul>
</div>
</div>
</div>
</div>

<div id="outline-container-technical-agenda" class="outline-2">
<h2 id="technical-agenda"><span class="section-number-2">2.</span> Technical Agenda</h2>
<div class="outline-text-2" id="text-technical-agenda">
</div>

<div id="outline-container-pr-832" class="outline-3">
<h3 id="pr-832"><span class="section-number-3">2.1.</span> PR #832: 77 Lookup returning path selection</h3>
<div class="outline-text-3" id="text-pr-832">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-832">#832</a>
</p>
</div>
</div>

<div id="outline-container-h-5424BD13-F672-457D-A2AD-9FBEBA413834" class="outline-3">
<h3 id="h-5424BD13-F672-457D-A2AD-9FBEBA413834"><span class="section-number-3">2.2.</span> Review of QT4CG-079-01: expert advice on hashing functions</h3>
<div class="outline-text-3" id="text-h-5424BD13-F672-457D-A2AD-9FBEBA413834">
<p>
Last week, WP suggested that we review this action. It’s possible that no advice
is forthcoming and we should consider other options.
</p>
</div>
</div>

<div id="outline-container-pr-1306" class="outline-3">
<h3 id="pr-1306"><span class="section-number-3">2.3.</span> PR #1306: 46 Add @as attribute to xsl:sequence</h3>
<div class="outline-text-3" id="text-pr-1306">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-1306">#1306</a>
</p>
</div>
</div>
<div id="outline-container-pr-1296" class="outline-3">
<h3 id="pr-1296"><span class="section-number-3">2.4.</span> PR #1296: 982 Rewrite of scan-left and scan-right</h3>
<div class="outline-text-3" id="text-pr-1296">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-1296">#1296</a>
</p>
</div>
</div>
<div id="outline-container-pr-1283" class="outline-3">
<h3 id="pr-1283"><span class="section-number-3">2.5.</span> PR #1283: 77b: Update expressions</h3>
<div class="outline-text-3" id="text-pr-1283">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-1283">#1283</a>
</p>
</div>
</div>
<div id="outline-container-pr-1266" class="outline-3">
<h3 id="pr-1266"><span class="section-number-3">2.6.</span> PR #1266: 1158 Add array mapping operator</h3>
<div class="outline-text-3" id="text-pr-1266">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-1266">#1266</a>
</p>
</div>
</div>
<div id="outline-container-pr-1263" class="outline-3">
<h3 id="pr-1263"><span class="section-number-3">2.7.</span> PR #1263: 1224 Add xsl:accumulator-rule/@priority attribute</h3>
<div class="outline-text-3" id="text-pr-1263">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-1263">#1263</a>
</p>
</div>
</div>
<div id="outline-container-pr-1262" class="outline-3">
<h3 id="pr-1262"><span class="section-number-3">2.8.</span> PR #1262: 1160 Add collation-available() function</h3>
<div class="outline-text-3" id="text-pr-1262">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-1262">#1262</a>
</p>
</div>
</div>
<div id="outline-container-pr-1244" class="outline-3">
<h3 id="pr-1244"><span class="section-number-3">2.9.</span> PR #1244: 566-partial Rewrite parse-uri</h3>
<div class="outline-text-3" id="text-pr-1244">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-1244">#1244</a>
</p>
</div>
</div>
<div id="outline-container-pr-1228" class="outline-3">
<h3 id="pr-1228"><span class="section-number-3">2.10.</span> PR #1228: – Adding the BLAKE3 hashing algorithm to fn:hash</h3>
<div class="outline-text-3" id="text-pr-1228">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-1228">#1228</a>
</p>
</div>
</div>
<div id="outline-container-pr-1209" class="outline-3">
<h3 id="pr-1209"><span class="section-number-3">2.11.</span> PR #1209: 1183 Add transient mode and the transient{} expression</h3>
<div class="outline-text-3" id="text-pr-1209">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-1209">#1209</a>
</p>
</div>
</div>
<div id="outline-container-pr-1185" class="outline-3">
<h3 id="pr-1185"><span class="section-number-3">2.12.</span> PR #1185: 1179 array:values, map:values → array:get, map:get</h3>
<div class="outline-text-3" id="text-pr-1185">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-1185">#1185</a>
</p>
</div>
</div>
</div>

<div id="outline-container-any-other-business" class="outline-2">
<h2 id="any-other-business"><span class="section-number-2">3.</span> Any other business</h2>
<div class="outline-text-2" id="text-any-other-business">
</div>
</div>
</div>
</body>
</html>
